#include<iostream>
void main() {
	using namespace std;
	setlocale(LC_ALL, "Russian");
	float p, i, n, q;
	//////////////////////////////////////////////////////////////
	cout << "\nДоп н2";
	cout << "\nВведите выручку в первый день = " << endl;
	cin >> p;
	cout << "\nВведите значение конечной выручки = ";
	cin >> q;
	int n_1 = 1;
	do {
		p = (p / 100) * 3 + p;
		n_1 = n_1 + 1;

	} while (p <= q);
	cout << "\nВыручка будет составлять" << " " << p << " " << "тысяч рублей" << endl;
	cout << "\nФирме придется торговать = " << n_1 << "дня" << endl;

	///////////////////////////////////////////

	cout << "\nДоп н6";
	float z = 2;
	int s = 0;
	for (int n_2 = 0; n_2 <= 20; n_2++) {
		cout << "\n " << pow(z, s) << endl;
		s = s + 1;
	}

	float k, g;
	cout << "Номер числа = " << endl;
	cin >> k;
	cout << "Ваше число = " << 2 * pow(2, k - 2) << endl;




	/////////////////////////////////////////////////////////////////////////////////////////
	for (int k = 1; k < 10; ++k)
		for (int o = 0; o < 10; ++o)
			for (int t = 0; t < 10; ++t) {
				if ((k * 100 + t * 10 + o) + (k * 100 + o * 10 + t) == (t * 100 + o * 10 + k))
					cout << "KТО+KOT=TOK " << k * 100 + t * 10 + o << '+' << k * 100 + o * 10 + t << '=' << t * 100 + o * 10 + k << endl;
			}
}

/////////////////////////////////////////////////////////////////////////////////////////

